<a href="https://colab.research.google.com/github/wisdom99416/Prac_class/blob/main/Practice_0325.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 4주차 코드 연습(data Wrangling)

#### Pivot_longer()

In [1]:
library(tidyverse)

Warning message in system("timedatectl", intern = TRUE):
“running command 'timedatectl' had status 1”
── Attaching packages ─────────────────────────────────────── tidyverse 1.3.0 ──

✔ ggplot2 3.3.3     ✔ purrr   0.3.4
✔ tibble  3.1.0     ✔ dplyr   1.0.5
✔ tidyr   1.1.3     ✔ stringr 1.4.0
✔ readr   1.4.0     ✔ forcats 0.5.1

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

In [2]:
table4a

table4a %>%
  pivot_longer(c('1999', '2000'), names_to = "year", values_to = "cases")

# years라는 변수 새로 생성해서 분리

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

  country     year cases
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

#### Pivot_wider()

In [3]:
table2

table2 %>% 
  pivot_wider(names_from = type, values_from = count)

# pivot_longer에서 한 것 반대로 돌리는 느낌
# 아까 위에서는 names_to 으로 해서 이름을 지정해줬다면 지금은 반대로 names_from으로 가져간다.

   country     year type       count
1  Afghanistan 1999 cases             745
2  Afghanistan 1999 population   19987071
3  Afghanistan 2000 cases            2666
4  Afghanistan 2000 population   20595360
5  Brazil      1999 cases           37737
6  Brazil      1999 population  172006362
7  Brazil      2000 cases           80488
8  Brazil      2000 population  174504898
9  China       1999 cases          212258
10 China       1999 population 1272915272
11 China       2000 cases          213766
12 China       2000 population 1280428583

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

#### Separate()

In [4]:
table3

table3 %>% 
  separate(rate, into = c("cases", "population"))

# 숫자가 아닌 애 자동으로 인식해서 구분해줌
# sep = "/" 이렇게 옵션 주면 지정 가능

  country     year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

  country     year cases  population
1 Afghanistan 1999 745    19987071
2 Afghanistan 2000 2666   20595360
3 Brazil      1999 37737  172006362
4 Brazil      2000 80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

#### Unite()

In [5]:
table5

table5 %>% 
  unite(new, century, year, sep = "")

# 둘의 구분을 어떻게 할 건지 sep = 으로 알려주기

  country     century year rate
1 Afghanistan 19      99   745/19987071
2 Afghanistan 20      00   2666/20595360
3 Brazil      19      99   37737/172006362
4 Brazil      20      00   80488/174504898
5 China       19      99   212258/1272915272
6 China       20      00   213766/1280428583

  country     new  rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

## Functional Programming

In [7]:
df <- tibble(
  a = rnorm(10),
  b = rnorm(10),
  c = rnorm(10),
  d = rnorm(10)
)

In [8]:
# c()로 공간을 만드는 것과 vector으로 공간 만드는 것의 차이
(output1 <- vector("double", ncol(df)))
(output2 <- c())

[1] 0 0 0 0

NULL

대부분 vector으로 공간 만들어서 입력하는 것이 더 빠르다.

#### Map function

In [10]:
str(df)

df %>%
  map_dbl(mean) 

# 벡터포멧으로 결과 얻기

tibble [10 × 4] (S3: tbl_df/tbl/data.frame)
 $ a: num [1:10] -0.404 -0.953 2.741 0.136 0.171 ...
 $ b: num [1:10] 0.3015 0.3209 1.4469 -0.0736 2.0645 ...
 $ c: num [1:10] -0.6684 -0.5174 0.6898 0.7074 -0.0128 ...
 $ d: num [1:10] -0.7835 -0.3428 1.243 -0.397 0.0815 ...

         a          b          c          d
0.08038088 0.53437723 0.24599824 0.03082312

In [11]:
df %>% 
  map(mean)
# 이렇게 돌리면 결과를 list로 얻음
# df %>% map(~mean(.)) 와 같은 결과 얻을 수 있음.

$a
[1] 0.08038088

$b
[1] 0.5343772

$c
[1] 0.2459982

$d
[1] 0.03082312

In [12]:
mtcars %>% 
  split(.$cyl) %>% 
  map(~lm(mpg ~ wt, data = .)) %>%
  map(summary)

# summary 한 것도 같이 출력

$`4`

Call:
lm(formula = mpg ~ wt, data = .)

Residuals:
    Min      1Q  Median      3Q     Max
-4.1513 -1.9795 -0.6272  1.9299  5.2523

Coefficients:
            Estimate Std. Error t value Pr(>|t|)
(Intercept)   39.571      4.347   9.104 7.77e-06 ***
wt            -5.647      1.850  -3.052   0.0137 *
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 3.332 on 9 degrees of freedom
Multiple R-squared:  0.5086,	Adjusted R-squared:  0.454
F-statistic: 9.316 on 1 and 9 DF,  p-value: 0.01374


$`6`

Call:
lm(formula = mpg ~ wt, data = .)

Residuals:
     Mazda RX4  Mazda RX4 Wag Hornet 4 Drive        Valiant       Merc 280
       -0.1250         0.5840         1.9292        -0.6897         0.3547
     Merc 280C   Ferrari Dino
       -1.0453        -1.0080

Coefficients:
            Estimate Std. Error t value Pr(>|t|)
(Intercept)   28.409      4.184   6.789  0.00105 **
wt            -2.780      1.335  -2.083  0.09176 .
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 1.165 on 5 degrees of freedom
Multiple R-squared:  0.4645,	Adjusted R-squared:  0.3574
F-statistic: 4.337 on 1 and 5 DF,  p-value: 0.09176


$`8`

Call:
lm(formula = mpg ~ wt, data = .)

Residuals:
    Min      1Q  Median      3Q     Max
-2.1491 -1.4664 -0.8458  1.5711  3.7619

Coefficients:
            Estimate Std. Error t value Pr(>|t|)
(Intercept)  23.8680     3.0055   7.942 4.05e-06 ***
wt           -2.1924     0.7392  -2.966   0.0118 *
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 2.024 on 12 degrees of freedom
Multiple R-squared:  0.423,	Adjusted R-squared:  0.3749
F-statistic: 8.796 on 1 and 12 DF,  p-value: 0.01179